modules/testsuite/cxf-tests/src/test/resources/jaxws/samples/jmstransport/WEB-INF/wsdl/jmstransport.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="OrganizationJMSEndpointService" targetNamespace="http://org.jboss.ws/samples/jmstransport" xmlns:jms="http://cxf.apache.org/transports/jms" xmlns:ns1="http://schemas.xmlsoap.org/wsdl/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://org.jboss.ws/samples/jmstransport" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <wsdl:message name="getContactInfoResponse">
    <wsdl:part name="return" type="xsd:string">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="getContactInfo">
    <wsdl:part name="arg0" type="xsd:string">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="Organization">
    <wsdl:operation name="getContactInfo">
      <wsdl:input message="tns:getContactInfo" name="getContactInfo">
    </wsdl:input>
      <wsdl:output message="tns:getContactInfoResponse" name="getContactInfoResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="HTTPSoapBinding" type="tns:Organization">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="getContactInfo">
      <soap:operation soapAction="" style="rpc"/>
      <wsdl:input name="getContactInfo">
        <soap:body namespace="http://org.jboss.ws/samples/jmstransport" use="literal"/>
      </wsdl:input>
      <wsdl:output name="getContactInfoResponse">
        <soap:body namespace="http://org.jboss.ws/samples/jmstransport" use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>

  <wsdl:binding name="JMSSoapBinding" type="tns:Organization">
    <soap:binding style="rpc" transport="http://cxf.apache.org/transports/jms"/>
    <wsdl:operation name="getContactInfo">
      <soap:operation soapAction="" style="rpc"/>
      <wsdl:input name="getContactInfo">
        <soap:body namespace="http://org.jboss.ws/samples/jmstransport" use="literal"/>
      </wsdl:input>
      <wsdl:output name="getContactInfoResponse">
        <soap:body namespace="http://org.jboss.ws/samples/jmstransport" use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>


  <wsdl:service name="OrganizationService">
    <wsdl:port binding='tns:HTTPSoapBinding' name='HttpEndpointPort'>
      <soap:address location='http://@jboss.bind.address@:8080/jaxws-samples-jmstransport'/>
    </wsdl:port>
    <wsdl:port binding="tns:JMSSoapBinding" name="JmsEndpointPort">
           <jms:address
                   destinationStyle="queue"
                   jndiConnectionFactoryName="ConnectionFactory" 
                   jndiDestinationName="queue/RequestQueue"
                   jndiReplyDestinationName="queue/ResponseQueue">
                   >                   
                </jms:address>    
        </wsdl:port>


  </wsdl:service>
</wsdl:definitions>
